// pages/user/authenticity/authenticity.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    declare_txt:"为提升武汉泰斗中医院服务质量，维护武汉泰斗中医院和用户的合法权益，武汉泰斗中医院特地开通了“防伪查询”服务平台，提供“微信号查询”服务，帮助用户辨微信号真伪，认准主体，防止不法分子钻空子，避免上当受骗。",
    queryData:[
      {"text": "1.打开微信找到您咨询对象的微信号"},
      {"text":"2.在查询框内输入咨询微信号"},
      {"text":"3.点击“确认查询”按钮"},
      {"text":"4.查看显示结果辨清主体"}
    ],
    intro_txt:"在“互联网+医疗”大趋势的影响下，武汉泰斗中医院积极响应国家号召，联合武汉大学安全学院共同开了全国首款M2O物联网智能诊断系统、DTP健康管理服务他系统，为广大用户提供互联网+中医的特色服务。同时，为维护医院和用的合法权益，帮助用户快速辨析、找准主体，医院开通了“微信号防伪查询”服役，防止用户上当受骗。",
    addressData:[
      { "text": "地址：湖北省武汉市洪山区雄楚大街428号 " },
      { "text": "电话：027-85555789" },
      { "text": "官网：http://www.whtdzyy.com/" },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})